app/controllers/products_controller.rb

  def index
    @products = Product.order('id asc').limit 20
---
SELECT  `products`.* FROM `products`  ORDER BY id asc LIMIT 20

  def search
    @products = Product.where('title LIKE(?)', "%#{params[:keyword]}%")
---
SELECT `products`.* FROM `products` WHERE (title LIKE('%%'))