app/controllers/reviews_controller.rb

  def create
    Review.create(create_params)
---
INSERT INTO `reviews` (`nickname`, `rate`, `review`, `product_id`, `created_at`, `updated_at`) VALUES ('aa', 1, 'aaa', 1, '2015-10-20 10:32:47', '2015-10-20 10:32:47')